[VCP_SparkGuardian X2SoldierClassTemplate]
+DisplayName="保卫者"
+ClassSummary="装甲交战守护者与集成支援单位。这些单位是加固的支援平台，设计用于吸收敌方火力，同时部署先进的修理系统来维持盟友的战斗力。它们配备有重型武器和防御技术，在激烈的战斗中充当坚不可摧的盾牌和生命线."

RankNames[0]="新手"
RankNames[1]="侍从"
RankNames[2]="有志者"
RankNames[3]="骑士"
RankNames[4]="骑兵"
RankNames[5]="先锋"
RankNames[6]="圣骑士"
RankNames[7]="勇士"
RankNames[8]="实体"

ShortNames[0]="Rk."
ShortNames[1]="Sqr."
ShortNames[2]="Asp."
ShortNames[3]="Knt."
ShortNames[4]="Cav."
ShortNames[5]="Vng."
ShortNames[6]="Pal."
ShortNames[7]="Chp."
ShortNames[8]="Ent."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_Fixer.rank_squire"
RankIcons[2]="UILibrary_Fixer.rank_cavalier"
RankIcons[3]="UILibrary_Fixer.rank_knight"
RankIcons[4]="UILibrary_Fixer.rank_vanguard"
RankIcons[5]="UILibrary_Fixer.rank_templar"
RankIcons[6]="UILibrary_Fixer.rank_paladin"
RankIcons[7]="UILibrary_Fixer.rank_champion"
RankIcons[8]="UILibrary_Fixer.rank_fieldmarshall"

[VCP_SparkEliminator X2SoldierClassTemplate]
+DisplayName="狙击手"
+ClassSummary="战略中和与渗透精准交战侦察单位。这些单位是先进的神射手无人机，专长于远程消灭和快速反应瞄准。凭借精准的准确度和自适应瞄准协议，它们在敌人尚未察觉自己已成为瞄准目标之前，就能悄无声息地消除威胁."

RankNames[0]="新手"
RankNames[1]="侍从"
RankNames[2]="有志者"
RankNames[3]="骑士"
RankNames[4]="骑兵"
RankNames[5]="先锋"
RankNames[6]="圣骑士"
RankNames[7]="勇士"
RankNames[8]="实体"

ShortNames[0]="Rk."
ShortNames[1]="Sqr."
ShortNames[2]="Asp."
ShortNames[3]="Knt."
ShortNames[4]="Cav."
ShortNames[5]="Vng."
ShortNames[6]="Pal."
ShortNames[7]="Chp."
ShortNames[8]="Ent."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_Fixer.rank_squire"
RankIcons[2]="UILibrary_Fixer.rank_cavalier"
RankIcons[3]="UILibrary_Fixer.rank_knight"
RankIcons[4]="UILibrary_Fixer.rank_vanguard"
RankIcons[5]="UILibrary_Fixer.rank_templar"
RankIcons[6]="UILibrary_Fixer.rank_paladin"
RankIcons[7]="UILibrary_Fixer.rank_champion"
RankIcons[8]="UILibrary_Fixer.rank_fieldmarshall"

[VCP_SparkCipher X2SoldierClassTemplate]
+DisplayName="黑客"
+ClassSummary="设计用于提供技术支持并入侵敌方单位."

RankNames[0]="新手"
RankNames[1]="侍从"
RankNames[2]="有志者"
RankNames[3]="骑士"
RankNames[4]="骑兵"
RankNames[5]="先锋"
RankNames[6]="圣骑士"
RankNames[7]="勇士"
RankNames[8]="实体"

ShortNames[0]="Rk."
ShortNames[1]="Sqr."
ShortNames[2]="Asp."
ShortNames[3]="Knt."
ShortNames[4]="Cav."
ShortNames[5]="Vng."
ShortNames[6]="Pal."
ShortNames[7]="Chp."
ShortNames[8]="Ent."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_Fixer.rank_squire"
RankIcons[2]="UILibrary_Fixer.rank_cavalier"
RankIcons[3]="UILibrary_Fixer.rank_knight"
RankIcons[4]="UILibrary_Fixer.rank_vanguard"
RankIcons[5]="UILibrary_Fixer.rank_templar"
RankIcons[6]="UILibrary_Fixer.rank_paladin"
RankIcons[7]="UILibrary_Fixer.rank_champion"
RankIcons[8]="UILibrary_Fixer.rank_fieldmarshall"

[VCP_SparkJuggernaut X2SoldierClassTemplate]
+DisplayName="战神"
+ClassSummary="装甲增强外骨骼战士。这些单位是重装甲的战争机器，专为前线统治而打造，将毁灭性的重火力攻击与几乎无法穿透的防御相结合。它们以耐力和强大火力为设计理念，在任何战场上都扮演着铁壁和重锤的角色."

RankNames[0]="新手"
RankNames[1]="侍从"
RankNames[2]="有志者"
RankNames[3]="骑士"
RankNames[4]="骑兵"
RankNames[5]="先锋"
RankNames[6]="圣骑士"
RankNames[7]="勇士"
RankNames[8]="实体"

ShortNames[0]="Rk."
ShortNames[1]="Sqr."
ShortNames[2]="Asp."
ShortNames[3]="Knt."
ShortNames[4]="Cav."
ShortNames[5]="Vng."
ShortNames[6]="Pal."
ShortNames[7]="Chp."
ShortNames[8]="Ent."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_Fixer.rank_squire"
RankIcons[2]="UILibrary_Fixer.rank_cavalier"
RankIcons[3]="UILibrary_Fixer.rank_knight"
RankIcons[4]="UILibrary_Fixer.rank_vanguard"
RankIcons[5]="UILibrary_Fixer.rank_templar"
RankIcons[6]="UILibrary_Fixer.rank_paladin"
RankIcons[7]="UILibrary_Fixer.rank_champion"
RankIcons[8]="UILibrary_Fixer.rank_fieldmarshall"

[VCP_SparkBrawler X2SoldierClassTemplate]
+DisplayName="格斗者"
+ClassSummary="设计用于在近距离摧毁敌人，同时能够承受极端伤害."

RankNames[0]="新手"
RankNames[1]="侍从"
RankNames[2]="有志者"
RankNames[3]="骑士"
RankNames[4]="骑兵"
RankNames[5]="先锋"
RankNames[6]="圣骑士"
RankNames[7]="勇士"
RankNames[8]="实体"

ShortNames[0]="Rk."
ShortNames[1]="Sqr."
ShortNames[2]="Asp."
ShortNames[3]="Knt."
ShortNames[4]="Cav."
ShortNames[5]="Vng."
ShortNames[6]="Pal."
ShortNames[7]="Chp."
ShortNames[8]="Ent."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_Fixer.rank_squire"
RankIcons[2]="UILibrary_Fixer.rank_cavalier"
RankIcons[3]="UILibrary_Fixer.rank_knight"
RankIcons[4]="UILibrary_Fixer.rank_vanguard"
RankIcons[5]="UILibrary_Fixer.rank_templar"
RankIcons[6]="UILibrary_Fixer.rank_paladin"
RankIcons[7]="UILibrary_Fixer.rank_champion"
RankIcons[8]="UILibrary_Fixer.rank_fieldmarshall"

